toy_app/app/controllers/microposts_controller.rb

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "mjk"], ["user_id", 4], ["created_at", "2026-01-29 07:30:13.849542"], ["updated_at", "2026-01-29 07:30:13.849542"]]